#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

//1.以下代码输出结果是什么
//int main()
//{
//	unsigned char a = 200;
//	//00000000000000000000000011001000
//	//11001000
//	unsigned char b = 100;
//	//00000000000000000000000001100100
//	//01100100
//	unsigned char c = 0;
//	//a和b整型提升  unsigned int
//	//00000000000000000000000011001000
//	//00000000000000000000000001100100
//	//00000000000000000000000100101100
//	//存放到unsigned char 中 要截断
//	//00101100
//	c = a + b;
//	printf("%d %d", a + b, c);//300  44
//	//a + b
//	//00000000000000000000000100101100
//	//c
//	//00000000000000000000000000101100
//	return 0;
//}

////2.以下代码在32位大端模式处理器上变量b等于什么？
//int main()
//{
//	unsigned int a = 0x1234;
//	//0x1234
//	unsigned char b = *(unsigned char*)&a;
//	//大端存储是：数据的低位存储在高地址位，数据的高位存储在低地址为
//	//所以a在内存中的存储顺序为 0x 00 00 12 34
//	//(unsigned char*)&a 转换之后可以看到的值是低地址为的前两个十六进制数，也就是0x00
//	//保存在unsigned char 中 b = 0x00，结果为0
//}

////3.打印杨辉三角
//int main()
//{
//	int arr[10][10] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//			if (j == 0)
//			{
//				arr[i][j] = 1;
//			}
//			else
//			{
//				arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
//			}
//		}
//	}
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//}


//找出凶手
//日本某地发生一件谋杀案，以下是四个嫌疑人的供词
//A说：不是我
//B说：是C
//C说：是D
//D说：C在胡说
//已知：3个人说了真话，一个人说了假话
//int main()
//{
//	char killer = 0;
//	for (killer = 'A'; killer <= 'D'; killer++)
//	{
//		if ((killer != 'A') + (killer == 'C') + (killer == 'D') + (killer != 'D') == 3)
//		{
//			printf("凶手是%c\n", killer);
//			break;
//		}
//	}
//	return 0;
//}